<html>

<head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    <link rel="stylesheet" href="Styles/CT4-1.css">
</head>

<body class="c4 c7">
    <div>
        <p class="c5"><span class="c1"></span></p>
    </div>
    <p class="c3"><span class="c2">Sergi Mayol Matos / 45610262C</span></p>
    <p class="c3 c6 c4"><span class="c0"></span></p>
    <p class="c3 c4"><span class="c0">&iquest;Por qu&eacute; crees que en los hipermercados hay colas
            &ldquo;r&aacute;pidas&rdquo; para clientes que lleven menos de un n&uacute;mero, relativamente bajo, de
            productos?</span></p>
    <p class="c3 c4"><span class="c0">&iquest;Por qu&eacute; crees que en algunos establecimientos hay cola &uacute;nica
            para los clientes y varios servidores para la cola &uacute;nica, en vez de usar varias colas, con una por
            servidor?</span></p>
    <p class="c3 c4"><span class="c0">Imagina una cola de facturaci&oacute;n en el aeropuerto, &iquest;qu&eacute;
            variables principales gobiernan la longitud de la cola?</span></p>
    <p class="c5"><span class="c1"></span></p>
    <p class="c3"><span>En los hipermercados existen las colas r&aacute;pidas para disminuir el tiempo de servicio, por
            lo que, si el tiempo es parecido entre los usuarios, este ser&aacute; estimable. Es decir, el tiempo de
            servicio se </span><span>convierte constante</span><span class="c1">&nbsp;y m&aacute;s controlable por parte
            del supermercado. </span></p>
    <p class="c3 c6"><span class="c1"></span></p>
    <p class="c3"><span class="c1">Al tener varios servidores y una &uacute;nica cola se evita la espera innecesaria, ya
            que as&iacute; la cola se ir&aacute; repartiendo entre los diversos servidores cuando estos se est&eacute;n
            vac&iacute;os. </span></p>
    <p class="c3 c6"><span class="c1"></span></p>
    <p class="c3"><span>Las principales variables son el n&uacute;mero total de servidores disponibles (cuantos
            m&aacute;s servidores menos tiempo de espera y viceversa), la velocidad de facturaci&oacute;n (si la
            facturaci&oacute;n es lenta el tiempo de espera aumentar&aacute;, mientras que si son r&aacute;pidos el
            tiempo disminuir&aacute;) y el tipo de cola (normalmente habr&aacute; una &uacute;nica cola).</span></p>
</body>

</html>