<html>

<head>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <link rel="stylesheet" href="CT2.css">
</head>

<body class="c3 c6">
        <p class="c2 c3 c5"><span class="c1"></span></p>
        <p class="c2 c3"><span class="c1">Si en vez de usar un servidor para ejecutar un programa se usa otro servidor
                        distinto, supongamos que se mejora el rendimiento con ese segundo servidor, ya que parece que el
                        programa
                        ahora se ejecuta en menos tiempo. Pero tambi&eacute;n sospechamos que se usa m&aacute;s la CPU
                        que en el
                        primero. &iquest;C&oacute;mo plantear&iacute;as la comprobaci&oacute;n de la mejora de un
                        servidor sobre el
                        otro? &iquest;Y de ese mayor uso de CPU? &iquest;C&oacute;mo podr&iacute;as establecer el
                        rendimiento de
                        ambos servidores para que la comparaci&oacute;n fuese justa?</span></p>
        <p class="c2 c3 c5"><span class="c1"></span></p>
        <p class="c2"><span class="c0">Para comprobar la mejora de un servidor sobre el otro, si obtenemos el tiempo de
                        ejecuci&oacute;n de cada servidor y realizamos una divisi&oacute;n entre ambos, logramos obtener
                        el % de
                        mejora de uno sobre el otro. En este caso, si dividimos el tiempo del primer servidor entre el
                        segundo, se
                        obtiene cuanto mejora el segundo sobre el primero.</span></p>
        <p class="c2 c5"><span class="c0"></span></p>
        <p class="c2"><span class="c0">La comprobaci&oacute;n de un mayor uso de la CPU, se puede obtener monitorizando
                        ambas CPUs, ya sea v&iacute;a hardware, software o un h&iacute;brido entre ambas, y ver el % de
                        uso en cada
                        servidor. La manera m&aacute;s sencilla ser&iacute;a con una monitorizaci&oacute;n v&iacute;a
                        software.</span></p>
        <p class="c2 c5"><span class="c0"></span></p>
        <p class="c2"><span>Para que fuese justa la comprobaci&oacute;n en ambos casos, se tendr&iacute;an que
                        monitorizar
                        en las mismas condiciones, misma carga y medir su rendimiento cuando se est&eacute;n empleando
                        al
                        100%.</span></p>
</body>

</html>