<html>

<head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    <link rel="stylesheet" href="CP_p4.css">
</head>

<body class="c8">
    <p class="c14 title" id="h.mnksy4xpn5zb"><span class="c13">Pr&aacute;ctica 4 </span></p>
    <p class="c4"><span class="c10">Bloque 1: Se pide responder a las siguientes preguntas </span></p>
    <p class="c3"><span class="c0"></span></p>
    <ol class="c6 lst-kix_mb1yrodeub6e-0 start" start="1">
        <li class="c4 c5 li-bullet-0"><span class="c0">&iquest;Cu&aacute;l es la principal diferencia entre la
                evaluaci&oacute;n de sistemas mediante la experimentaci&oacute;n real y el modelado? </span></li>
    </ol>
    <ul class="c6 lst-kix_tljh931zywc7-0 start">
        <li class="c4 c7 li-bullet-0"><span class="c0">La principal diferencia entre la evaluaci&oacute;n de sistemas
                mediante la experimentaci&oacute;n real y el modelado es que, en el caso del sistema modelado, los datos
                son los esperados de un modelo ficticio, es decir, no son datos seguros, normalmente, los datos
                obtenidos en el modelo ficticio var&iacute;an al realizar el experimento real. En cambio, en el modelo
                real se conocen los datos con certeza y no hay una gran variaci&oacute;n. </span></li>
    </ul>
    <p class="c1"><span class="c0"></span></p>
    <ol class="c6 lst-kix_mb1yrodeub6e-0" start="2">
        <li class="c4 c5 li-bullet-0"><span class="c0">&iquest;Qu&eacute; relaci&oacute;n hay entre ellas? </span></li>
    </ol>
    <ul class="c6 lst-kix_2tamhis1bj1u-0 start">
        <li class="c4 c7 li-bullet-0"><span class="c0">La relaci&oacute;n entre ambos tipos de evaluaci&oacute;n de
                sistemas es que, tanto la experimentaci&oacute;n real como la modela, tienen como objetivo evaluar un
                sistema para saber c&oacute;mo se comporta. Adem&aacute;s, ambos tipos, para estimar el comportamiento
                de un sistema, comparten recursos, ya sea la cantidad de usuarios, la velocidad del sistema, etc. Es
                decir, ambas evaluaciones tratan de pronosticar el comportamiento de un sistema.</span></li>
    </ul>
    <p class="c3 c9"><span class="c0"></span></p>
    <ol class="c6 lst-kix_mb1yrodeub6e-0" start="3">
        <li class="c4 c5 li-bullet-0"><span class="c0">&nbsp;&iquest;C&oacute;mo podr&iacute;amos combinar ambas formas
                de evaluaci&oacute;n? Explica detalladamente c&oacute;mo podr&iacute;amos combinarlas con un ejemplo de
                la vida real. </span></li>
    </ol>
    <ul class="c6 lst-kix_r54w35j4awq5-0 start">
        <li class="c4 c7 li-bullet-0"><span>Una forma de combinar ambos tipos de evaluaci&oacute;n ser&iacute;a, en
                primer lugar, realizar la evaluaci&oacute;n mediante modelado del sistema, siendo el sistema lo
                m&aacute;s semejante posible al real. Para realizar la evaluaci&oacute;n, es necesario que se tenga en
                cuenta que, existe la posibilidad de que muchos usuarios hagan uso del sistema al mismo tiempo y generen
                grandes cargas. Una vez realizado el modelado ficticio, el siguiente paso es realizar la
                evaluaci&oacute;n real, donde, con los resultados obtenidos en la evaluaci&oacute;n modelada, m&aacute;s
                o menos se sabe c&oacute;mo actuar&aacute; el sistema, aunque al realizarlo con una carga real, los
                resultados esperados pueden variar bastante. Por ejemplo, un caso en la vida real ser&iacute;a: Una
                tienda quiere publicar su propia p&aacute;gina web y est&aacute; buscando un servidor que soporte una
                gran cantidad de peticiones por minuto. Para ello, se realiza un modelado del sistema con cargas
                ficticias, para comprobar que el servidor que van emplear es adecuado para ellos. Una vez realizada la
                evaluaci&oacute;n, ya sabr&aacute;n, m&aacute;s o menos, </span><span>como</span><span
                class="c0">&nbsp;se comportar&aacute; el sistema, pero para verificar que estos datos son correctos, se
                realiza la experimentaci&oacute;n real y se contrastan los datos obtenidos. A partir de este contraste
                de datos, se puede obtener una conclusi&oacute;n y tomar una decisi&oacute;n.</span></li>
    </ul>
    <p class="c3"><span class="c0"></span></p>
    <p class="c3"><span class="c0"></span></p>
    <p class="c4"><span class="c10">Bloque 2 </span></p>
    <p class="c3"><span class="c0"></span></p>
    <p class="c4"><span class="c0">Consideremos la carga Stress-ng ejecutada en la pr&aacute;ctica 3. En concreto, el
            que es ejecutado al 100% de uso de la CPU. De la ejecuci&oacute;n de esta carga se obtuvo un tiempo medio de
            respuesta. Adem&aacute;s, ahora se concreta que el tiempo medio de ejecuci&oacute;n es de 1,23 segundos.
            Tambi&eacute;n, la CPU recibe una media de dos programas por segundo (del tipo Stress-ng). Se pide calcular:
        </span></p>
    <p class="c3"><span class="c0"></span></p>
    <ol class="c6 lst-kix_x9szj8cmzixn-0 start" start="1">
        <li class="c4 c5 li-bullet-0"><span class="c0">Utilizaci&oacute;n media del procesador. </span></li>
    </ol>
    <ul class="c6 lst-kix_i19f3cyhx8qq-0 start">
        <li class="c4 c7 li-bullet-0"><span class="c0">Aplicando la ley de la utilizaci&oacute;n, y teniendo en cuenta
                que se cumple la hip&oacute;tesis del flujo de equilibrado de trabajos, se obtiene:</span></li>
    </ul>
    <p class="c2"><img src="images/image1.png"></p>
    <p class="c2"><span class="c0">Por lo tanto, la utilizaci&oacute;n media del procesador es de: 2,46.</span></p>
    <p class="c1"><span class="c0"></span></p>
    <ol class="c6 lst-kix_x9szj8cmzixn-0" start="2">
        <li class="c4 c5 li-bullet-0"><span class="c0">Tiempo medio de espera en la cola del procesador. </span></li>
    </ol>
    <ul class="c6 lst-kix_hcyycim9h3ir-0 start">
        <li class="c4 c7 li-bullet-0"><span class="c0">El tiempo media de espera en la cola del procesador, se obtiene a
                partir de:</span></li>
    </ul>
    <p class="c4 c9"><img src="images/image2.png"></p>
    <p class="c4 c9"><span class="c0">Es decir, el tiempo medio de espera ser&aacute; de 134,68 segundos.</span></p>
    <p class="c1"><span class="c0"></span></p>
    <ol class="c6 lst-kix_x9szj8cmzixn-0" start="3">
        <li class="c4 c5 li-bullet-0"><span class="c0">N&uacute;mero medio de programadas en la cola de espera del
                procesador</span></li>
    </ol>
    <ul class="c6 lst-kix_d3gvrx5nwi3d-0 start">
        <li class="c4 c7 li-bullet-0"><span>Aplicando la ley de Little a la cola de espera del procesador, y teniendo en
                cuenta que la productividad de la cola es la misma que la del procesador, adem&aacute;s de conocerse el
                tiempo de espera en la cola, el n&uacute;mero medio de programas en la cola de espera del procesador es
                de </span><img src="images/image3.png"><span>.</span></li>
    </ul>
</body>

</html>